[
  {
    "id": 1,
    "imagenes": "Essen",
    "tituloEsp": "WebNegocio Essen",
    "fechaRealizacionEsp": "Julio 2023 - Diciembre 2023",
    "duracionEsp": "6 meses",
    "descripcionEsp": "Soporte y desarrollo de la página de uso interno de los Emprendedores, así como de proveedores y otras áreas de la empresa, para carga de pedidos, pagos con tarjetas de crédito y débito (integrada con múltiples medios de pago en Argentina, Bolivia, Chile, Paraguay, Perú y Uruguay), creación de reclamos de atención al cliente, visualización de reportes y gestión de su red y sus clientes. Manejo de tickets para agregado de nuevas funciones, resolución de errores, asignación de permisos y ayuda a operadores de Argentina y de las filiales internacionales. Desarrollo y modificación de stored procedures para conexión a base de datos, conexión con un sistema de gestión ERP, trabajo con metodologías ágiles.",
    "mejorasEsp": "Se determinan en cada sprint los objetivos del equipo, a través de la metodología Agile/SCRUM se dividen las tareas a realizar en los distintos sprints, llevando el registro y control de lo completado en cada período.",
    "tecnologiasUtilizadas": [
      "ASP.NET",
      ".NET Framework",
      "SQL",
      "C#",
      "JavaScript",
      "GitLab"
    ],
    "tituloEng": "WebNegocio Essen",
    "fechaRealizacionEng": "July 2023 - December 2023",
    "duracionEng": "6 months",
    "descripcionEng": "Support and development for the internal use website for the Entrepreneurs, as well as suppliers and other areas of the company, for order placement, credit and debit card payments (integrated with multiple payment methods in Argentina, Bolivia, Chile, Paraguay, Peru and Uruguay), creation of customer service claims, visualization of reports and management of their network and customers. Handling tickets for new feature requests, bug fixes, permission assignment and help for operators in Argentina and international branches. Development and modification of stored procedures for database connection, connection with an ERP management system, work with agile methodologies.",
    "mejorasEng": "For each sprint the team objectives are determined through the Agile/SCRUM methodology, dividing the tasks in the different sprints, keeping track of what was completed in each time frame.",
    "pageLink": "https://web.essen.com.ar/latam/login.aspx"
  },
  {
    "id": 2,
    "imagenes": "NextPlan",
    "tituloEsp": "ExxonMobil Apps",
    "fechaRealizacionEsp": "Marzo 2022 - Junio 2023",
    "duracionEsp": "1 año 4 meses",
    "descripcionEsp": "Desarrollo y soporte de las aplicaciones de uso interno en mi pasantía en ExxonMobil, en el equipo de Modern Application Development. Las aplicaciones incluyen NextPlan (utilizada por responsables de planeamiento estratégico), DVT (utilizada por analistas de datos para encontrar errores en bases de datos masivas), SACS (utilizada por responsables de seguridad en pozos de exploración no convencional, para crear y gestionar alertas), entre otras. Creación y ampliación de endpoints en APIs, integración con Microsoft Azure y GitHub, testeos periódicos del código de las distintas aplicaciones.",
    "mejorasEsp": "Se determinan en cada incremento los objetivos del equipo, a través de la metodología Agile/SCRUM se dividen las tareas a realizar en los distintos sprints que componen al incremento, llevando el registro y control de lo completado en cada período.",
    "tecnologiasUtilizadas": [
      "React",
      "TypeScript",
      ".NET",
      "C#",
      "Bootstrap",
      "GitHub"
    ],
    "tituloEng": "ExxonMobil Apps",
    "fechaRealizacionEng": "March 2022 - June 2023",
    "duracionEng": "1 year 4 months",
    "descripcionEng": "Development and support for internal use applications in my internship at ExxonMobil, inside the Modern Application Development team. The supported apps include NextPlan (used by development planners), DVT (used by data stewards to find issues in massive data sets), SACS (used by security officials in unconventional exploration wells to create and manage alerts), among others. Creation and addition of endpoints in APIs, integration with Microsoft Azure and GitHub, periodic code testing for the different applications.",
    "mejorasEng": "For each Program Increment the team objectives are determined through the Agile/SCRUM methodology, dividing the tasks in the different sprints that are part of the increment, keeping track of what was completed in each time frame."
  },
  {
    "id": 3,
    "imagenes": "Facultad",
    "tituloEsp": "Páginas para Ingeniería Civil",
    "fechaRealizacionEsp": "Marzo 2022 - Diciembre 2022",
    "duracionEsp": "9 meses",
    "descripcionEsp": "Distintas páginas para la carrera de Ingeniería Civil en la UTN FRBA, con el objetivo de incorporar conceptos de materias como Geotecnia (a través de la utilización de una página web para la clasificación de suelos por sistemas SUCS y AASHTO, cálculo de límite líquido y límite plástico de un suelo) y Tecnología del Hormigón (mediante módulos de Verdadero o Falso y cálculo de dosificación de hormigones). Las páginas fueron desarrolladas utilizando elementos básicos de React y Bootstrap, sin prestar mucha atención al diseño ya que son utilizadas solo por un grupo de estudiantes y no lanzadas al público en general.",
    "mejorasEsp": "Crear más páginas para automatizar procesos de Ingeniería, incorporar nuevas funcionalidades y hacer el código más simple y accesible para poder reutilizarlo en distintas tareas.",
    "tituloEng": "Civil Engineering Websites",
    "fechaRealizacionEng": "March 2022 - December 2022",
    "duracionEng": "9 months",
    "descripcionEng": "Websites for the degree of Civil Engineering at the UTN FRBA, with the goal of incorporating concepts from subjects like Geotechnics (by using a website to sort out soil by SUCS and AASHTO systems, estimate liquid limit and plastic limit of a soil), and Concrete Technology (through True or False module and calculation for concrete dosage). The pages were developed using basic elements from React and Bootstrap, not paying a lot of attention to the design, since they are only used by a small group of students and not launched to the general public.",
    "mejorasEng": "Create more websites to automate engineering processes, incorporate new functionalities and make code easier and more accessible so it can be reused in different tasks.",
    "tecnologiasUtilizadas": ["React", "JavaScript", "Bootstrap", "Next.js"],
    "pageLink": "https://geotecniautnfrba.vercel.app/",
    "gitHubLink": "https://github.com/dariovillar1902/geotecniautnfrba"
  },
  {
    "id": 4,
    "imagenes": "Helplab",
    "tituloEsp": "Helplab Tienda",
    "fechaRealizacionEsp": "Abril 2022",
    "duracionEsp": "1 semana",
    "descripcionEsp": "Se realizó el sitio web e-commerce para la tienda de Helplab, con páginas que muestran los distintos productos que se venden, incluyendo auriculares, relojes inteligentes, parlantes, teclados, mouse, cargadores y otros productos. La tienda tiene distintos productos con fotos, descripción, división en categorías, etiquetas, etc. También se incluye el contacto, la posibilidad de buscar, ordenar o filtrar productos, configurar medios de pago y más.",
    "tituloEng": "Helplab Store",
    "fechaRealizacionEng": "April 2022",
    "duracionEng": "1 week",
    "descripcionEng": "Designed the e-commerce website for the Helplab store, with pages showcasing the different products that are sold in the shop, such as headphones, smart watches, speakers, keyboards, mouse, chargers and other products. The store has different products with pictures, descriptions, division in categories, tags and more. Other features included are contact information, the possibility to order, filter or search products, configure payment methods and more.",
    "tecnologiasUtilizadas": ["WordPress", "JavaScript", "Bootstrap"],
    "pageLink": "https://helplabtienda.com/"
  },
  {
    "id": 5,
    "imagenes": "Wordle",
    "tituloEsp": "Wordle - Español",
    "fechaRealizacionEsp": "Marzo 2022",
    "duracionEsp": "3 días",
    "descripcionEsp": "Adaptación del popular juego Wordle en español, permitiendo el input del usuario de forma manual o a través del teclado. La mecánica es la misma que la del juego original, con las letras introduciéndose a medida que el usuario tipea, y luego actualizando sus colores a amarillo o verde según si la letra está o no en la palabra y su posición. Las letras no utilizadas se ocultan en el teclado, al igual que en el juego. Se pueden compartir los resultados copiándolos al portapapeles.",
    "mejorasEsp": "Actualizar el juego para incorporar palabras de más letras, palabras con tildes, etc. Mejorar el sistema que permite ocultar las letras en el teclado. Incorporar modo claro y opción para jugar una sola vez por día.",
    "tituloEng": "Wordle in Spanish",
    "fechaRealizacionEng": "March 2022",
    "duracionEng": "3 days",
    "descripcionEng": "Adaptation of the popular game Wordle in Spanish, allowing user input either manually or through the keyboard. The mechanics are the same as the original game, with the letters being introduced as the user types, and then updating their colors to yellow or green depending on whether the letter is or isn't in the word and its position. The unused letters are hidden in the keyboard, just like in the game. The results can be shared by copying them to the clipboard.",
    "mejorasEng": "Update the game to add words that have more letters, words with tildes, etc. Improve the system that allows to hide the letters in the keyboard. Add light mode and option to play only once a day.",
    "tecnologiasUtilizadas": ["React", "JavaScript", "HTML", "CSS"],
    "pageLink": "https://wordlees.vercel.app/",
    "gitHubLink": "https://github.com/dariovillar1902/wordlees"
  },
  {
    "id": 6,
    "imagenes": "DarioVillar",
    "tituloEsp": "Página Personal - Darío Villar",
    "fechaRealizacionEsp": "Noviembre 2021 - Diciembre 2022",
    "duracionEsp": "5 días",
    "descripcionEsp": "Esta misma página fue creada desde cero debido a la necesidad de tener un lugar donde mostrar mis proyectos de desarrollo web. Hice uso de múltiples recursos visuales y herramientas de diseño para hacer una página agradable, con un maquetado simple que permita ver mi información personal de forma clara, ordenada y divertida. Aprendí a usar componentes de muchas fuentes distintas, tales como tsParticles, elementos para barras de progreso, gradientes de texto con CSS, contadores automáticos con JS y varios componentes de Bootstrap como Modals, Carruseles y Tooltips. Además, esta página es 100% responsive, por lo que puede ser visualizada desde dispositivos de cualquier tamaño sin ningún problema. La página tiene 4 secciones: un Inicio atractivo visualmente que invita a quien entre a la página a continuar navegando, una sección Sobre Mi con información personal y estadísticas sobre mi desempeño, una sección de Portfolio en donde muestro mis proyectos y una sección de Contacto en donde se puede descargar mi CV y carta de presentación, así como enviarme comentarios o sugerencias. ",
    "mejorasEsp": "Implementar modo claro, páginas en español e inglés, seguir mejorando la página para que sea más atractiva visualmente y ampliar mi portfolio.",
    "tecnologiasUtilizadas": [
      "React",
      "HTML5",
      "CSS3",
      "Bootstrap",
      "JavaScript",
      "jQuery"
    ],
    "tituloEng": "Personal Page - Dario Villar",
    "fechaRealizacionEng": "November 2021 - December 2022",
    "duracionEng": "5 days",
    "descripcionEng": "This website was created from scratch due to my requirement of having a place to show my web development projects. I used multiple visual tools and resources to create a nice page, with a simple design which shows my personal information in a clear, orderly and fun way. I learned how to use components from many different sources, such as tsParticles, progress bar elements, text gradients with CSS, automatic counters with JS and many Bootstrap components including Modals, Carrousels and Tooltips. This website is also 100% responsive, so it can be visited from different devices without any issues. The page has 4 sections: a visually attractive Home, which invites visitors to continue browsing, an About Me section with personal information and stats about my performance, a Portfolio section where I showcase my projects and a Contact section where my Resume and Cover Letter can be downloaded, and comments and suggestions can be sent to me.",
    "mejorasEng": "Add light mode, English and Spanish sections, keep improving the page to make it more visually attractive and expand my portfolio.",
    "pageLink": "https://dariovillar.vercel.app/",
    "gitHubLink": "https://github.com/dariovillar1902/dariovillar"
  },
  {
    "id": 7,
    "imagenes": "Viajes",
    "tituloEsp": "Viajes99.NET",
    "fechaRealizacionEsp": "Diciembre 2021",
    "duracionEsp": "2 semanas",
    "descripcionEsp": "Esta página fue creada para el proyecto integrador del curso de Desarrollador .NET de Becas NEORIS en conjunto con UTN FRBA. Se presentó esta página a los Ingenieros Roxana Leituz y Pablo Mendez, profesores de Ingeniería en Sistemas, quienes la aprobaron debido al buen trabajo realizado en el frontend y el backend. En mi grupo de trabajo de 2 personas, mi compañero se encargó de la vista del sistema de viajes, mientras que yo me encargué de la funcionalidad del sistema. Se pueden cargar clientes, paquetes y facturas en el sistema, que luego se pueden editar, borrar o ver más en detalle. Hay funciones para listar clientes que cumplan cierta condición (por ejemplo, clientes con al menos dos paquetes vendidos), o para ver la cantidad y el monto totales de los viajes de un cliente en particular. Todos estos datos se guardan en una base de datos a través de SQL.",
    "tituloEng": "Viajes99.NET",
    "fechaRealizacionEng": "December 2021",
    "duracionEng": "2 weeks",
    "descripcionEng": "This page was created for the final project from the .NET Developer course from Becas NEORIS together with UTN FRBA. This page was presented to the Engineers Roxana Leituz and Pablo Mendez, Systems Engineering teachers, who approved it due to the good work performed in the frontend and the backend. In my workgroup of 2 people, my partner handled the view of the travel system, while I handled the functionalities of the system. Clients, packages and bills can be loaded into the system, which then can be edited, deleted or seen more in detail. There are features which allow to list customers who fulfill certain conditions (such as clients which at least two packages sold, for example), or to see the number and total amount of a customer's trips. All of this data is stored in a database through SQL.",
    "tecnologiasUtilizadas": ["ASP.NET", "Razor", "MVC", "C#", "SQL", "jQuery"],
    "gitHubLink": "https://github.com/dariovillar1902/Viajes99.NET"
  },
  {
    "id": 8,
    "imagenes": "Arg",
    "tituloEsp": "100 Argentinos Dicen",
    "fechaRealizacionEsp": "Septiembre 2021",
    "duracionEsp": "1 semana",
    "descripcionEsp": "Recreación de la pantalla digital del popular programa 100 Argentinos Dicen/Family Feud. Se realiza una pregunta y se muestran hasta 8 respuestas principales, en orden de más popular a menos popular. Dos equipos compiten por ver quién puede acumular la mayor cantidad de puntos producto de adivinar la mayor cantidad de opciones posibles. Tienen hasta 3 intentos (cruces) para conseguir todas las opciones. Controles: Barra espaciadora (sonido del pulsador), Enter (revela la pregunta), 1 a 8 (revela la opción con el número correspondiente), Flecha derecha (pasa a la siguiente pregunta), Cualquier otra tecla (agrega una cruz). Al final del programa, dos de los participantes del equipo ganador se someten al dinero rápido. En esta ronda, se hacen 5 preguntas de las cuales se deben adivinar las opciones más populares. Uno de los jugadores responde primero, debe responder en 20 segundos. Luego, responde el otro jugador en 25 segundos, pero no puede repetir ninguna de las opciones que ya dijo el jugador anterior. Si en esta ronda se consiguen 200 puntos, se gana el juego.",
    "mejorasEsp": "Configurar preguntas con sus opciones que se puedan subir y editar fácilmente, y agregar los nombres de los dos equipos que juegan con la puntuación parcial de cada equipo.",
    "tituloEng": "Family Feud",
    "fechaRealizacionEng": "September 2021",
    "duracionEng": "1 week",
    "descripcionEng": "Copy of the digital screen that appears on the popular TV show 100 Argentinos Dicen/Family Feud. A question is asked and up to 8 answers are shown, in order from most popular to least popular. Two teams compete to see who can collect the most points by guessing the most right answers. They have up to 3 attempts (crosses) to get all the options. Controls: Space bar (buzzer sound), Enter (reveal the question), 1 to 8 (reveals the answer with the respective number), Right arrow (go to the next question), Any other key (add a cross). At the end of the show, two of the contestants from the winning team face the Fast Money. In this round, 5 questions are asked, and the most popular answers to each question must be guessed by the players. One of the players answers first, they must answer in 20 seconds. Then, the other player answers in 25 seconds, but they cannot repeat any of the options which were already said by the other player. If on this round 200 points are reached, the game is won.",
    "mejorasEng": "Configure easily uploadable and editable questions and options, add the names of the two competing teams and the score of each team.",
    "tecnologiasUtilizadas": ["HTML5", "CSS3", "JavaScript", "jQuery", "SMTP"],
    "pageLink": "https://100argentinosdicen.vercel.app",
    "gitHubLink": "https://github.com/dariovillar1902/100argentinosdicen"
  },
  {
    "id": 9,
    "imagenes": "CAH",
    "tituloEsp": "Hasta Donde Puedas online",
    "fechaRealizacionEsp": "Agosto 2021",
    "duracionEsp": "1 mes",
    "descripcionEsp": "Recreación del popular juego Hasta Donde Puedas/Cards Against Humanity en versión online. Se elige una carta negra al azar y luego se reparten 10 cartas blancas a cada jugador. Por turnos, los jugadores deben elegir la carta blanca que crean que mejor completa a la carta negra. Luego, todos los jugadores votan por la carta que les parece más graciosa, y le otorgan un punto. El primer jugador que llega a 5 puntos gana el juego. Controles: Drag and drop sobre las cartas con el mouse, luego en la votación hacer click sobre la carta elegida, Números del 1 al 0 para elegir la carta en la posición correspondiente durante el juego, luego números del 1 a la cantidad de jugadores para elegir la carta en la votación. Posibilidad de activar modo automático (juega y vota automáticamente en cada ronda), mezclar todas las cartas hasta 3 veces en una partida, activar modo claro u oscuro, cambiar opciones de juego.",
    "mejorasEsp": "Agregar salas, mejorar el estilo general del juego, permitir la inclusión de los distintos packs y extensiones que trae el juego real.",
    "tecnologiasUtilizadas": [
      "Node.js",
      "Phaser 3",
      "Socket.IO",
      "HTML5",
      "Express",
      "Heroku"
    ],
    "tituloEng": "Cards Against Humanity",
    "fechaRealizacionEng": "August 2021",
    "duracionEng": "1 month",
    "descripcionEng": "An online version of the popular game Hasta Donde Puedas/Cards Against Humanity. A black card is picked randomly and 10 white cards are dealt to each player. Taking turns, the players must choose the white card that they think completes the prompt from the black card the best. Afterwards, all players vote for the card they think was the funniest, and the winner gets a point. The first player to get to 5 points wins. Controls: Drag and drop over the cards with the mouse, then at the vote click on the chosen card. Numbers from 1 to 0 to pick the card with the respective index during the game, then numbers from 1 to the amount of players to pick the respective card during the vote. Possibility to activate auto mode (plays and votes automatically in each round), shuffle cards up to 3 times per game, activate light or dark mode, change game options.",
    "mejorasEng": "Add rooms, improve the overall look of the game, allow different packs and extensions that come with the real game.",
    "pageLink": "https://hdpjuego.herokuapp.com/",
    "gitHubLink": "https://github.com/dariovillar1902/cah"
  },
  {
    "id": 10,
    "imagenes": "QWQ",
    "tituloEsp": "QWQ Latino América LLC",
    "fechaRealizacionEsp": "2018 - 2019",
    "duracionEsp": "1 mes",
    "descripcionEsp": "Esta página fue creada para la empresa de Oftalmología QWQ Latino América LLC. Es una página básica con información sobre los productos de oftalmología HD Analyzer y Tear Film Analyzer, sus folletos y características correspondientes. También tiene una sección de contacto con un formulario que envía un mensaje directamente a los responsables de atención al cliente de la compañía. La página es 100% responsive, puede verse desde dispositivos móviles sin problemas. Lamentablemente, el hosting de esta página fue descontinuado, por lo que no es posible visitarla. Lo que se ve en las fotos es toda la información que fue posible rescatar. Sin embargo, fue el primer proyecto en el que tuve contacto con clientes, y me aseguré de escuchar e interpretar sus pedidos para obtener una página atractiva e informativa.",
    "tituloEng": "QWQ Latino America LLC",
    "fechaRealizacionEng": "2018 - 2019",
    "duracionEng": "1 month",
    "descripcionEng": "This website was created for the ophtalmology company QWQ Latino América LLC. It is a basic page with information about the ophtalmology products HD Analyzer and Tear Film Analyzer, and their respective brochures and characteristics. It also has a Contact section with a form which sends comments directly to the people in charge of customer service for the company. The site is 100% responsive, it can be seen without issues through mobile devices. Unfortunately, the hosting for this website was discontinued, so it is not posible to visit it. What is in the photos is all the information I was able to recollect about the page. However, it was the first project of mine in which I had contact with a client, and I made sure to hear and acknowledge their requests in order to have an attractive and informative page.",
    "tecnologiasUtilizadas": ["HTML5", "CSS3", "Bootstrap", "JavaScript", "PHP"]
  },
  {
    "id": 11,
    "imagenes": "Syzygy",
    "tituloEsp": "Syzygy Consulting Group",
    "fechaRealizacionEsp": "Octubre 2017",
    "duracionEsp": "1 mes",
    "descripcionEsp": "Esta página fue creada para un trabajo práctico de la materia Comercialización, en 4° año de mi colegio secundario. Es una página bastante básica debido a que en ese momento sólo sabía HTML, CSS y JavaScript básico. La página era 100% responsive a través de Bootstrap, por lo que podía ser vista desde cualquier dispositivo. En mi grupo de trabajo de 2 personas, mi compañero se encargó de la confección del logo en distintas variantes (visible en la página de inicio) y yo realicé enteramente el desarrollo de esta página. Tomamos en cuenta todas las correcciones del profesor, aplicándolas como si fuera un cliente y preguntando todo lo que fuera necesario para mejorar nuestra página. Lamentablemente, el hosting de esta página fue descontinuado, por lo que no es posible visitarla. Lo que se ve en las fotos es toda la información que fue posible rescatar. Sin embargo, fue mi primer proyecto y aprendí mucho.",
    "tituloEng": "Syzygy Consulting Group",
    "fechaRealizacionEng": "October 2017",
    "duracionEng": "1 month",
    "descripcionEng": "This website was created for a project from the Marketing subject at my high school. It is a fairly basic website since at that moment I only knew HTML, CSS and JavaScript on a basic level. The website was 100% responsive through Bootstrap, so it could be seen from any device. In my group consisting of 2 people, my partner handled the logo design in different hues and color schemes, which were visible in the Home section, and I coded the entirety of the website. We took into account every suggestion from the teacher, treating them as observations from a client and asking for all the information needed to improve the site.Unfortunately, the hosting for this website was discontinued, so it is not posible to visit it. What is in the photos is all the information I was able to recollect about the page. However, it was my first proyect and I learned a lot.",
    "tecnologiasUtilizadas": [
      "HTML5",
      "CSS3",
      "Bootstrap",
      "JavaScript",
      "jQuery"
    ]
  }
]
